#include <iostream>

using namespace std;

int main() {
    /*
     * 1. Ввести целое число. Определить, является ли оно положительным, отрицательным или равным нулю.
     * 2. Определить, является ли введённое целое число чётным или нечётным
     * 3. Определить, является ли число одновременно положительным и кратным 3
    */

    int num { 5 };

    if ( num > 0) {
        cout << "положительный" << endl;

        if (num % 3 == 0) {
            cout << "кратный 3" << endl;
        } else {
            cout << "не кратный 3" << endl;
        }
    } else if ( num < 0 ) {
        cout << "отрицательный" << endl;
    } else {
        cout << "равен нулю" << endl;
    }

    if (num % 2 == 0) {
        cout << "четный" << endl;
    } else {
        cout << "нечетный" << endl;
    }

    return 0;
}