#include <iostream>

using namespace std;

int main() {

    /*
     * 1. Перевести температуру из градусов Цельсия в градусы Фаренгейта: F = C*9.0/5.0 + 32.
     * 2. Для введённой температуры C вычислить температуру в Фаренгейтах и Кельвинах: K = C + 273.15.
     * 3. Ввести две температуры в градусах Цельсия. Перевести обе в Фаренгейты и вычислить разность температур в шкале Цельсия и Фаренгейта.
    */

    double c1 {}, c2 {};
    cin >> c1 >> c2;

    double f1 { c1 * 9.0 / 5.0 + 32 };
    double f2 { c2 * 9.0 / 5.0 + 32 };

    cout << "Разность в °C: " << (c2 - c1) << "\n";
    cout << "Разность в °F: " << (f2 - f1) << "\n";

    double k { c2 + 273.15 };
    cout << k << endl;

    return 0;
}