#include <iostream>

using namespace std;

int main() {
    /*
     * 1. Ввести номер года. Определить, делится ли он на 4
     * 2. Определить високосный год по правилу: год високосный,
     *    если делится на 400 либо делится на 4 и не делится на 100.
     * 3. Вывести одно из сообщений: «високосный год», «обычный год»;
     *    дополнительно проверить, что введённый год положительный.
    */

    int year { 120 };
    bool leapYear { year % 4 == 0 && year % 100 != 0 || year % 400 == 0};

    if (year > 0) {
        if (leapYear) {
            cout << "високосный" << endl;
        } else {
            cout << "обычный" << endl;
        }
    } else {
        cout << "неверное значение" << endl;
    }

    return 0;
}